In [ ]:
# Capstone Project: Python Fundamentals
# Author: [jhansy]
# Description: This project demonstrates data creation, preprocessing, merging,
# conditional updates, string manipulation, aggregation, and filtering using Python and Pandas.

In [1]:
import pandas as pd   # importing pandas library to create dataframes

In [2]:
# Creating Employee DataFrame
employee_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Name': ['John Alter', 'Alice Luxumberg', 'Tom Sabestine', 'Nina Adgra', 'Amy Johny'],
    'Gender': ['M', 'F', 'M', 'F', 'F'],
    'City': ['Paris', 'London', 'Berlin', 'Newyork', 'Madrid'],
    'Age': [25, 27, 29, 31, 30]
}

employee_df = pd.DataFrame(employee_data)
employee_df

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [3]:
# Creating Seniority Level DataFrame
seniority_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Designation Level': [2, 2, 3, 2, 3]
}

seniority_df = pd.DataFrame(seniority_data)
seniority_df

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [4]:
# Creating Project DataFrame
project_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005', 'A002', 'A005', 'A003', 'A001', 'A003', 'A001', 'A004', 'A004', 'A005'],
    'Project': ['Project 1', 'Project 2', 'Project 3', 'Project 4', 'Project 5', 'Project 6', 'Project 7', 'Project 8', 'Project 9', 'Project 10', 'Project 11', 'Project 12', 'Project 13', 'Project 14'],
    'Cost': [1002000, 2000000, 4500000, 5500000, None, 680000, 400000, 350000, None, 300000, 2000000, 1000000, 3000000, 200000],
    'Status': ['Finished', 'Ongoing', 'Finished', 'Ongoing', 'Finished', 'Failed', 'Finished', 'Failed', 'Ongoing', 'Finished', 'Failed', 'Ongoing', 'Finished', 'Finished']
}

project_df = pd.DataFrame(project_data)
project_df

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [5]:
# Saving all DataFrames as CSV files
employee_df.to_csv('Employee.csv', index=False)
seniority_df.to_csv('SeniorityLevel.csv', index=False)
project_df.to_csv('Project.csv', index=False)

In [6]:
import pandas as pd   # (if not already imported)

project_df = pd.read_csv('Project.csv')  # loading the csv file
project_df   # display dataframe

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [28]:
# Task 1: Creating the required dataframes manually for Employee, Seniority Level, and Project details
# Storing the data in dictionary format and converting into pandas DataFrames
# Saving the created DataFrames into CSV files for further tasks

In [7]:
# Task 2: Replace missing cost values using running average with a for loop

import numpy as np  # to handle numeric operations

# Creating variables to hold running sum and count of valid values
running_sum = 0
count = 0

# Loop through each row
for i in range(len(project_df)):
    if pd.isna(project_df.loc[i, 'Cost']):  # Check if Cost is NaN
        project_df.loc[i, 'Cost'] = running_sum / count   # replace NaN with running average
    else:
        running_sum += project_df.loc[i, 'Cost']  # update running sum
        count += 1                                # update count

project_df  # display updated dataframe

      ID     Project          Cost    Status
0   A001   Project 1  1.002000e+06  Finished
1   A002   Project 2  2.000000e+06   Ongoing
2   A003   Project 3  4.500000e+06  Finished
3   A004   Project 4  5.500000e+06   Ongoing
4   A005   Project 5  3.250500e+06  Finished
5   A002   Project 6  6.800000e+05    Failed
6   A005   Project 7  4.000000e+05  Finished
7   A003   Project 8  3.500000e+05    Failed
8   A001   Project 9  2.061714e+06   Ongoing
9   A003  Project 10  3.000000e+05  Finished
10  A001  Project 11  2.000000e+06    Failed
11  A004  Project 12  1.000000e+06   Ongoing
12  A004  Project 13  3.000000e+06  Finished
13  A005  Project 14  2.000000e+05  Finished

In [9]:
project_df.to_csv('Project.csv', index=False)

In [10]:
import pandas as pd  # only if not already imported

employee_df = pd.read_csv('Employee.csv')  # loading the CSV file
employee_df  # display dataframe

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [29]:
# Task 2: Replacing missing cost values with running average using a for loop
# Calculating running sum and count of available values
# Updating missing cost values based on running average logic

In [13]:
# Task 3: Split Name column into First Name and Last Name

employee_df[['First Name', 'Last Name']] = employee_df['Name'].str.split(
    pat=' ',      # split by space
    n=1,          # split into 2 parts
    expand=True   # return as separate columns
)

# Drop original Name column
employee_df = employee_df.drop(columns=['Name'])

# Display updated employee data
employee_df

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [14]:
employee_df.to_csv('Employee.csv', index=False)

In [15]:
import pandas as pd   # already imported earlier, but no issue if repeated

# Loading updated files
employee_df = pd.read_csv('Employee.csv')
seniority_df = pd.read_csv('SeniorityLevel.csv')
project_df = pd.read_csv('Project.csv')

# Display to confirm they are loaded correctly
employee_df, seniority_df, project_df

(     ID Gender     City  Age First Name  Last Name
 0  A001      M    Paris   25       John      Alter
 1  A002      F   London   27      Alice  Luxumberg
 2  A003      M   Berlin   29        Tom  Sabestine
 3  A004      F  Newyork   31       Nina      Adgra
 4  A005      F   Madrid   30        Amy      Johny,
      ID  Designation Level
 0  A001                  2
 1  A002                  2
 2  A003                  3
 3  A004                  2
 4  A005                  3,
       ID     Project          Cost    Status
 0   A001   Project 1  1.002000e+06  Finished
 1   A002   Project 2  2.000000e+06   Ongoing
 2   A003   Project 3  4.500000e+06  Finished
 3   A004   Project 4  5.500000e+06   Ongoing
 4   A005   Project 5  3.250500e+06  Finished
 5   A002   Project 6  6.800000e+05    Failed
 6   A005   Project 7  4.000000e+05  Finished
 7   A003   Project 8  3.500000e+05    Failed
 8   A001   Project 9  2.061714e+06   Ongoing
 9   A003  Project 10  3.000000e+05  Finished
 10  A001  Project 11  2.000000e+06    Failed
 11  A004  Project 12  1.000000e+06   Ongoing
 12  A004  Project 13  3.000000e+06  Finished
 13  A005  Project 14  2.000000e+05  Finished)

In [30]:
# Task 3: Splitting the Name column into First Name and Last Name
# Using string split and assigning back to new columns
# Removing original Name column after split

In [16]:
# Task 4: Join all three dataframes into a single Final dataframe

# Load all CSV files
employee_df = pd.read_csv('Employee.csv')
seniority_df = pd.read_csv('SeniorityLevel.csv')
project_df = pd.read_csv('Project.csv')

# Merge employee & seniority using ID column
final_df = pd.merge(employee_df, seniority_df, on='ID')

# Merge with project dataframe
final_df = pd.merge(final_df, project_df, on='ID')

# Display Final dataframe
final_df

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,M,Paris,25,John,Alter,2,Project 1,1.002000e+06,Finished
1,A001,M,Paris,25,John,Alter,2,Project 9,2.061714e+06,Ongoing
2,A001,M,Paris,25,John,Alter,2,Project 11,2.000000e+06,Failed
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing
4,A002,F,London,27,Alice,Luxumberg,2,Project 6,6.800000e+05,Failed
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4.500000e+06,Finished
6,A003,M,Berlin,29,Tom,Sabestine,3,Project 8,3.500000e+05,Failed
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,3.000000e+05,Finished
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5.500000e+06,Ongoing
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1.000000e+06,Ongoing
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3.000000e+06,Finished
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3.250500e+06,Finished
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,4.000000e+05,Finished
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,2.000000e+05,Finished

In [31]:
# Task 4: Merging all three DataFrames into a single final DataFrame using common column 'ID'
# First merging Employee and Seniority dataframes
# Then merging Project dataframe to get complete project-level records

In [17]:
# Task 5: Add Bonus Column

# Using condition: if Status == 'Finished', bonus = 5% of Cost, else 0
final_df['Bonus'] = final_df.apply(lambda row: row['Cost'] * 0.05 if row['Status'] == 'Finished' else 0, axis=1)

# Display updated dataframe
final_df

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,M,Paris,25,John,Alter,2,Project 1,1.002000e+06,Finished,50100.0
1,A001,M,Paris,25,John,Alter,2,Project 9,2.061714e+06,Ongoing,0.0
2,A001,M,Paris,25,John,Alter,2,Project 11,2.000000e+06,Failed,0.0
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing,0.0
4,A002,F,London,27,Alice,Luxumberg,2,Project 6,6.800000e+05,Failed,0.0
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4.500000e+06,Finished,225000.0
6,A003,M,Berlin,29,Tom,Sabestine,3,Project 8,3.500000e+05,Failed,0.0
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,3.000000e+05,Finished,15000.0
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5.500000e+06,Ongoing,0.0
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1.000000e+06,Ongoing,0.0
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3.000000e+06,Finished,150000.0
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3.250500e+06,Finished,162525.0
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,4.000000e+05,Finished,20000.0
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,2.000000e+05,Finished,10000.0

In [18]:
final_df.to_csv('Final.csv', index=False)

In [32]:
# Task 5: Adding Bonus column - providing 5% bonus of Project Cost only for Finished projects
# Bonus value set to 0 for all other Status types

In [19]:
# Task 6: Demote designation level for failed projects and remove levels above 4

# Demote designation level by 1 (increase number) where Status is 'Failed'
final_df['Designation Level'] = final_df.apply(
    lambda row: row['Designation Level'] + 1 if row['Status'] == 'Failed' else row['Designation Level'],  # change only for failed
    axis=1  # apply row-wise
)

# Remove rows where designation level is now greater than 4
final_df = final_df[final_df['Designation Level'] <= 4]  # keep only eligible employees

# Display updated dataframe
final_df

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,M,Paris,25,John,Alter,2,Project 1,1.002000e+06,Finished,50100.0
1,A001,M,Paris,25,John,Alter,2,Project 9,2.061714e+06,Ongoing,0.0
2,A001,M,Paris,25,John,Alter,3,Project 11,2.000000e+06,Failed,0.0
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing,0.0
4,A002,F,London,27,Alice,Luxumberg,3,Project 6,6.800000e+05,Failed,0.0
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4.500000e+06,Finished,225000.0
6,A003,M,Berlin,29,Tom,Sabestine,4,Project 8,3.500000e+05,Failed,0.0
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,3.000000e+05,Finished,15000.0
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5.500000e+06,Ongoing,0.0
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1.000000e+06,Ongoing,0.0
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3.000000e+06,Finished,150000.0
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3.250500e+06,Finished,162525.0
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,4.000000e+05,Finished,20000.0
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,2.000000e+05,Finished,10000.0

In [20]:
final_df.to_csv('Final.csv', index=False)  # saving updated final data

In [33]:
# Task 6: Demoting designation level by 1 where project status is Failed
# Removing employee records with designation level > 4 as they lose eligibility

In [21]:
# Task 7: Add Mr/Mrs to First Name and drop Gender

# Adding prefix based on gender
final_df['First Name'] = final_df.apply(
    lambda row: ('Mr. ' + row['First Name']) if row['Gender'] == 'M' else ('Mrs. ' + row['First Name']),
    axis=1
)

# Drop the gender column
final_df = final_df.drop(columns=['Gender'])

# Display updated dataframe
final_df

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,Paris,25,Mr. John,Alter,2,Project 1,1.002000e+06,Finished,50100.0
1,A001,Paris,25,Mr. John,Alter,2,Project 9,2.061714e+06,Ongoing,0.0
2,A001,Paris,25,Mr. John,Alter,3,Project 11,2.000000e+06,Failed,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,3,Project 6,6.800000e+05,Failed,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4.500000e+06,Finished,225000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,4,Project 8,3.500000e+05,Failed,0.0
7,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 10,3.000000e+05,Finished,15000.0
8,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 4,5.500000e+06,Ongoing,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 12,1.000000e+06,Ongoing,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 13,3.000000e+06,Finished,150000.0
11,A005,Madrid,30,Mrs. Amy,Johny,3,Project 5,3.250500e+06,Finished,162525.0
12,A005,Madrid,30,Mrs. Amy,Johny,3,Project 7,4.000000e+05,Finished,20000.0
13,A005,Madrid,30,Mrs. Amy,Johny,3,Project 14,2.000000e+05,Finished,10000.0

In [22]:
final_df.to_csv('Final.csv', index=False)

In [34]:
# Task 7: Adding title prefix Mr./Mrs. based on Gender column to First Name
# Dropping the Gender column from the final dataframe

In [23]:
# Task 8: Promote designation level by 1 for employees with Age > 29

final_df['Designation Level'] = final_df.apply(
    lambda row: row['Designation Level'] - 1 if row['Age'] > 29 else row['Designation Level'],
    axis=1
)

# Display updated dataframe
final_df

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
0,A001,Paris,25,Mr. John,Alter,2,Project 1,1.002000e+06,Finished,50100.0
1,A001,Paris,25,Mr. John,Alter,2,Project 9,2.061714e+06,Ongoing,0.0
2,A001,Paris,25,Mr. John,Alter,3,Project 11,2.000000e+06,Failed,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,3,Project 6,6.800000e+05,Failed,0.0
5,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4.500000e+06,Finished,225000.0
6,A003,Berlin,29,Mr. Tom,Sabestine,4,Project 8,3.500000e+05,Failed,0.0
7,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 10,3.000000e+05,Finished,15000.0
8,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 4,5.500000e+06,Ongoing,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 12,1.000000e+06,Ongoing,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 13,3.000000e+06,Finished,150000.0
11,A005,Madrid,30,Mrs. Amy,Johny,2,Project 5,3.250500e+06,Finished,162525.0
12,A005,Madrid,30,Mrs. Amy,Johny,2,Project 7,4.000000e+05,Finished,20000.0
13,A005,Madrid,30,Mrs. Amy,Johny,2,Project 14,2.000000e+05,Finished,10000.0

In [24]:
final_df.to_csv('Final.csv', index=False)

In [35]:
# Task 8: Promoting employees by decreasing designation level by 1 where Age > 29

In [25]:
# Task 9: Add total cost of all projects for each employee

# Grouping by ID and summing cost
total_cost_df = final_df.groupby(['ID', 'First Name'])['Cost'].sum().reset_index()

# Renaming column
total_cost_df = total_cost_df.rename(columns={'Cost': 'Total Cost'})

# Display new dataframe
total_cost_df

     ID  First Name    Total Cost
0  A001    Mr. John  5.063714e+06
1  A002  Mrs. Alice  2.680000e+06
2  A003     Mr. Tom  5.150000e+06
3  A004   Mrs. Nina  9.500000e+06
4  A005    Mrs. Amy  3.850500e+06

In [26]:
total_cost_df.to_csv('TotalProjCost.csv', index=False)

In [36]:
# Task 9: Creating new dataframe TotalProjCost by calculating total cost per employee
# Using groupby and sum operations to aggregate project cost

In [27]:
# Task 10: Print all employee details whose city contains the letter "o"

filtered_df = final_df[final_df['City'].str.contains('o', case=False)]
filtered_df

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status,Bonus
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2000000.0,Ongoing,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,3,Project 6,680000.0,Failed,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 4,5500000.0,Ongoing,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 12,1000000.0,Ongoing,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 13,3000000.0,Finished,150000.0

In [37]:
# Task 10: Filtering employees whose City contains the letter 'o'
# Using string contains() function to match case insensitive values

In [39]:
## Conclusion
##This project covered data creation, data preprocessing, merging datasets, handling missing values using running averages, 
##conditional transformations, string manipulations, group-by aggregations, and filtering operations using Python and Pandas.
##The final output included a complete merged dataset and a summary table of total project cost per employee.